app/controllers/events_controller.rb

  def create
    @event = Event.new event_params
    if @event.save
---
INSERT INTO "events" ("bracket", "created_at", "date", "description", "event_type", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @event = Event.find params[:id]
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @event = Event.find params[:id]
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @event = Event.find params[:id]
    if @event.update_attributes event_params
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "bracket" = ?, "event_type" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["bracket", "Non-Elimination"], ["event_type", "Magic The Gathering"], ["updated_at", "2014-06-09 04:36:05.946935"]]

  def destroy
    Event.find(params[:id]).destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 5]]